3D_riblet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 #includeIfPresent "../parameters.dat"


convertToMeters 1e-6;

//N of riblets
//d = 92 : 4
//d = 46 : 6
//d = 23 : 9
//
// ribletX_nC $d_92_params.ribletX_nC; //the no. of x-cells in the blocks on/above the riblets
// plateauX_nC $d_92_params.plateauX_nC; //the no. of x-cells in the blocks on/above the space between riblets
//
// surfaceY_nC $d_92_params.surfaceY_nC; //the no. of y-cells in the blocks on the surface
// fluidY_nC $d_92_params.fluidY_nC; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)
//
// ribletX_nC $d_46_params.ribletX_nC; //the no. of x-cells in the blocks on/above the riblets
// plateauX_nC $d_46_params.plateauX_nC; //the no. of x-cells in the blocks on/above the space between riblets
//
// surfaceY_nC $d_46_params.surfaceY_nC; //the no. of y-cells in the blocks on the surface
// fluidY_nC $d_46_params.fluidY_nC; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)
// //
ribletX_nC $d_23_params.ribletX_nC; //the no. of x-cells in the blocks on/above the riblets
plateauX_nC $d_23_params.plateauX_nC; //the no. of x-cells in the blocks on/above the space between riblets

surfaceY_nC $d_23_params.surfaceY_nC; //the no. of y-cells in the blocks on the surface
fluidY_nC $d_23_params.fluidY_nC; //the n0. of y-cells in the blocks in the surrounding fluid (e.g. ocean)

LBlockX_nC 16; //no. of x-cells in the inlet blocks
RBlockX_nC 25; //no. of x-cells in the outlet blocks

r_grading_x 2; //grading of the x-mesh on the RHS of the riblet
l_grading_x #calc "1./$r_grading_x";

t_grading_y 6; //grading of the y-mesh on the bottom blocks (riblet surface)
b_grading_y #calc "1./2.";

outlet_xGrading 9; //x-grading of the outlet x-cells
inlet_xGrading #calc "1./$outlet_xGrading"; //x-grading of the inlet x-cells

vertices
(
	(0.000  0.000  0.000)	 //vertex 0
	(6.900  0.000  0.000)	 //vertex 1
	(11.500  0.000  0.000)	 //vertex 2
	(43.745  0.000  0.000)	 //vertex 3
	(48.345  0.000  0.000)	 //vertex 4
	(55.245  0.000  0.000)	 //vertex 5
	(62.145  0.000  0.000)	 //vertex 6
	(66.745  0.000  0.000)	 //vertex 7
	(98.989  0.000  0.000)	 //vertex 8
	(103.589  0.000  0.000)	 //vertex 9
	(110.489  0.000  0.000)	 //vertex 10
	(117.389  0.000  0.000)	 //vertex 11
	(121.989  0.000  0.000)	 //vertex 12
	(154.234  0.000  0.000)	 //vertex 13
	(158.834  0.000  0.000)	 //vertex 14
	(165.734  0.000  0.000)	 //vertex 15
	(172.634  0.000  0.000)	 //vertex 16
	(177.234  0.000  0.000)	 //vertex 17
	(209.478  0.000  0.000)	 //vertex 18
	(214.078  0.000  0.000)	 //vertex 19
	(220.978  0.000  0.000)	 //vertex 20
	(227.878  0.000  0.000)	 //vertex 21
	(232.478  0.000  0.000)	 //vertex 22
	(264.723  0.000  0.000)	 //vertex 23
	(269.323  0.000  0.000)	 //vertex 24
	(276.223  0.000  0.000)	 //vertex 25
	(283.123  0.000  0.000)	 //vertex 26
	(287.723  0.000  0.000)	 //vertex 27
	(319.967  0.000  0.000)	 //vertex 28
	(324.567  0.000  0.000)	 //vertex 29
	(331.467  0.000  0.000)	 //vertex 30
	(338.367  0.000  0.000)	 //vertex 31
	(342.967  0.000  0.000)	 //vertex 32
	(375.212  0.000  0.000)	 //vertex 33
	(379.812  0.000  0.000)	 //vertex 34
	(386.712  0.000  0.000)	 //vertex 35
	(393.612  0.000  0.000)	 //vertex 36
	(398.212  0.000  0.000)	 //vertex 37
	(430.457  0.000  0.000)	 //vertex 38
	(435.057  0.000  0.000)	 //vertex 39
	(441.957  0.000  0.000)	 //vertex 40
	(448.857  0.000  0.000)	 //vertex 41
	(453.457  0.000  0.000)	 //vertex 42
	(485.701  0.000  0.000)	 //vertex 43
	(490.301  0.000  0.000)	 //vertex 44
	(497.201  0.000  0.000)	 //vertex 45
	(0.000  42.000  0.000)	 //vertex 46
	(6.900  42.000  0.000)	 //vertex 47
	(27.622  42.000  0.000)	 //vertex 48
	(48.345  42.000  0.000)	 //vertex 49
	(55.245  42.000  0.000)	 //vertex 50
	(62.145  42.000  0.000)	 //vertex 51
	(82.867  42.000  0.000)	 //vertex 52
	(103.589  42.000  0.000)	 //vertex 53
	(110.489  42.000  0.000)	 //vertex 54
	(117.389  42.000  0.000)	 //vertex 55
	(138.111  42.000  0.000)	 //vertex 56
	(158.834  42.000  0.000)	 //vertex 57
	(165.734  42.000  0.000)	 //vertex 58
	(172.634  42.000  0.000)	 //vertex 59
	(193.356  42.000  0.000)	 //vertex 60
	(214.078  42.000  0.000)	 //vertex 61
	(220.978  42.000  0.000)	 //vertex 62
	(227.878  42.000  0.000)	 //vertex 63
	(248.601  42.000  0.000)	 //vertex 64
	(269.323  42.000  0.000)	 //vertex 65
	(276.223  42.000  0.000)	 //vertex 66
	(283.123  42.000  0.000)	 //vertex 67
	(303.845  42.000  0.000)	 //vertex 68
	(324.567  42.000  0.000)	 //vertex 69
	(331.467  42.000  0.000)	 //vertex 70
	(338.367  42.000  0.000)	 //vertex 71
	(359.090  42.000  0.000)	 //vertex 72
	(379.812  42.000  0.000)	 //vertex 73
	(386.712  42.000  0.000)	 //vertex 74
	(393.612  42.000  0.000)	 //vertex 75
	(414.334  42.000  0.000)	 //vertex 76
	(435.057  42.000  0.000)	 //vertex 77
	(441.957  42.000  0.000)	 //vertex 78
	(448.857  42.000  0.000)	 //vertex 79
	(469.579  42.000  0.000)	 //vertex 80
	(490.301  42.000  0.000)	 //vertex 81
	(497.201  42.000  0.000)	 //vertex 82
	(0.000  200.000  0.000)	 //vertex 83
	(6.900  200.000  0.000)	 //vertex 84
	(27.622  200.000  0.000)	 //vertex 85
	(48.345  200.000  0.000)	 //vertex 86
	(55.245  200.000  0.000)	 //vertex 87
	(62.145  200.000  0.000)	 //vertex 88
	(82.867  200.000  0.000)	 //vertex 89
	(103.589  200.000  0.000)	 //vertex 90
	(110.489  200.000  0.000)	 //vertex 91
	(117.389  200.000  0.000)	 //vertex 92
	(138.111  200.000  0.000)	 //vertex 93
	(158.834  200.000  0.000)	 //vertex 94
	(165.734  200.000  0.000)	 //vertex 95
	(172.634  200.000  0.000)	 //vertex 96
	(193.356  200.000  0.000)	 //vertex 97
	(214.078  200.000  0.000)	 //vertex 98
	(220.978  200.000  0.000)	 //vertex 99
	(227.878  200.000  0.000)	 //vertex 100
	(248.601  200.000  0.000)	 //vertex 101
	(269.323  200.000  0.000)	 //vertex 102
	(276.223  200.000  0.000)	 //vertex 103
	(283.123  200.000  0.000)	 //vertex 104
	(303.845  200.000  0.000)	 //vertex 105
	(324.567  200.000  0.000)	 //vertex 106
	(331.467  200.000  0.000)	 //vertex 107
	(338.367  200.000  0.000)	 //vertex 108
	(359.090  200.000  0.000)	 //vertex 109
	(379.812  200.000  0.000)	 //vertex 110
	(386.712  200.000  0.000)	 //vertex 111
	(393.612  200.000  0.000)	 //vertex 112
	(414.334  200.000  0.000)	 //vertex 113
	(435.057  200.000  0.000)	 //vertex 114
	(441.957  200.000  0.000)	 //vertex 115
	(448.857  200.000  0.000)	 //vertex 116
	(469.579  200.000  0.000)	 //vertex 117
	(490.301  200.000  0.000)	 //vertex 118
	(497.201  200.000  0.000)	 //vertex 119
	(0.000  0.000  0.100)	 //vertex 120
	(6.900  0.000  0.100)	 //vertex 121
	(11.500  0.000  0.100)	 //vertex 122
	(43.745  0.000  0.100)	 //vertex 123
	(48.345  0.000  0.100)	 //vertex 124
	(55.245  0.000  0.100)	 //vertex 125
	(62.145  0.000  0.100)	 //vertex 126
	(66.745  0.000  0.100)	 //vertex 127
	(98.989  0.000  0.100)	 //vertex 128
	(103.589  0.000  0.100)	 //vertex 129
	(110.489  0.000  0.100)	 //vertex 130
	(117.389  0.000  0.100)	 //vertex 131
	(121.989  0.000  0.100)	 //vertex 132
	(154.234  0.000  0.100)	 //vertex 133
	(158.834  0.000  0.100)	 //vertex 134
	(165.734  0.000  0.100)	 //vertex 135
	(172.634  0.000  0.100)	 //vertex 136
	(177.234  0.000  0.100)	 //vertex 137
	(209.478  0.000  0.100)	 //vertex 138
	(214.078  0.000  0.100)	 //vertex 139
	(220.978  0.000  0.100)	 //vertex 140
	(227.878  0.000  0.100)	 //vertex 141
	(232.478  0.000  0.100)	 //vertex 142
	(264.723  0.000  0.100)	 //vertex 143
	(269.323  0.000  0.100)	 //vertex 144
	(276.223  0.000  0.100)	 //vertex 145
	(283.123  0.000  0.100)	 //vertex 146
	(287.723  0.000  0.100)	 //vertex 147
	(319.967  0.000  0.100)	 //vertex 148
	(324.567  0.000  0.100)	 //vertex 149
	(331.467  0.000  0.100)	 //vertex 150
	(338.367  0.000  0.100)	 //vertex 151
	(342.967  0.000  0.100)	 //vertex 152
	(375.212  0.000  0.100)	 //vertex 153
	(379.812  0.000  0.100)	 //vertex 154
	(386.712  0.000  0.100)	 //vertex 155
	(393.612  0.000  0.100)	 //vertex 156
	(398.212  0.000  0.100)	 //vertex 157
	(430.457  0.000  0.100)	 //vertex 158
	(435.057  0.000  0.100)	 //vertex 159
	(441.957  0.000  0.100)	 //vertex 160
	(448.857  0.000  0.100)	 //vertex 161
	(453.457  0.000  0.100)	 //vertex 162
	(485.701  0.000  0.100)	 //vertex 163
	(490.301  0.000  0.100)	 //vertex 164
	(497.201  0.000  0.100)	 //vertex 165
	(0.000  42.000  0.100)	 //vertex 166
	(6.900  42.000  0.100)	 //vertex 167
	(27.622  42.000  0.100)	 //vertex 168
	(48.345  42.000  0.100)	 //vertex 169
	(55.245  42.000  0.100)	 //vertex 170
	(62.145  42.000  0.100)	 //vertex 171
	(82.867  42.000  0.100)	 //vertex 172
	(103.589  42.000  0.100)	 //vertex 173
	(110.489  42.000  0.100)	 //vertex 174
	(117.389  42.000  0.100)	 //vertex 175
	(138.111  42.000  0.100)	 //vertex 176
	(158.834  42.000  0.100)	 //vertex 177
	(165.734  42.000  0.100)	 //vertex 178
	(172.634  42.000  0.100)	 //vertex 179
	(193.356  42.000  0.100)	 //vertex 180
	(214.078  42.000  0.100)	 //vertex 181
	(220.978  42.000  0.100)	 //vertex 182
	(227.878  42.000  0.100)	 //vertex 183
	(248.601  42.000  0.100)	 //vertex 184
	(269.323  42.000  0.100)	 //vertex 185
	(276.223  42.000  0.100)	 //vertex 186
	(283.123  42.000  0.100)	 //vertex 187
	(303.845  42.000  0.100)	 //vertex 188
	(324.567  42.000  0.100)	 //vertex 189
	(331.467  42.000  0.100)	 //vertex 190
	(338.367  42.000  0.100)	 //vertex 191
	(359.090  42.000  0.100)	 //vertex 192
	(379.812  42.000  0.100)	 //vertex 193
	(386.712  42.000  0.100)	 //vertex 194
	(393.612  42.000  0.100)	 //vertex 195
	(414.334  42.000  0.100)	 //vertex 196
	(435.057  42.000  0.100)	 //vertex 197
	(441.957  42.000  0.100)	 //vertex 198
	(448.857  42.000  0.100)	 //vertex 199
	(469.579  42.000  0.100)	 //vertex 200
	(490.301  42.000  0.100)	 //vertex 201
	(497.201  42.000  0.100)	 //vertex 202
	(0.000  200.000  0.100)	 //vertex 203
	(6.900  200.000  0.100)	 //vertex 204
	(27.622  200.000  0.100)	 //vertex 205
	(48.345  200.000  0.100)	 //vertex 206
	(55.245  200.000  0.100)	 //vertex 207
	(62.145  200.000  0.100)	 //vertex 208
	(82.867  200.000  0.100)	 //vertex 209
	(103.589  200.000  0.100)	 //vertex 210
	(110.489  200.000  0.100)	 //vertex 211
	(117.389  200.000  0.100)	 //vertex 212
	(138.111  200.000  0.100)	 //vertex 213
	(158.834  200.000  0.100)	 //vertex 214
	(165.734  200.000  0.100)	 //vertex 215
	(172.634  200.000  0.100)	 //vertex 216
	(193.356  200.000  0.100)	 //vertex 217
	(214.078  200.000  0.100)	 //vertex 218
	(220.978  200.000  0.100)	 //vertex 219
	(227.878  200.000  0.100)	 //vertex 220
	(248.601  200.000  0.100)	 //vertex 221
	(269.323  200.000  0.100)	 //vertex 222
	(276.223  200.000  0.100)	 //vertex 223
	(283.123  200.000  0.100)	 //vertex 224
	(303.845  200.000  0.100)	 //vertex 225
	(324.567  200.000  0.100)	 //vertex 226
	(331.467  200.000  0.100)	 //vertex 227
	(338.367  200.000  0.100)	 //vertex 228
	(359.090  200.000  0.100)	 //vertex 229
	(379.812  200.000  0.100)	 //vertex 230
	(386.712  200.000  0.100)	 //vertex 231
	(393.612  200.000  0.100)	 //vertex 232
	(414.334  200.000  0.100)	 //vertex 233
	(435.057  200.000  0.100)	 //vertex 234
	(441.957  200.000  0.100)	 //vertex 235
	(448.857  200.000  0.100)	 //vertex 236
	(469.579  200.000  0.100)	 //vertex 237
	(490.301  200.000  0.100)	 //vertex 238
	(497.201  200.000  0.100)	 //vertex 239

	(-500.000  0.000  0.000)	 //(edge block) vertex 0
	(-500.000  42.000  0.000)	 //(edge block) vertex 1
	(-500.000  200.000  0.000)	 //(edge block) vertex 2
	(-500.000  0.000  0.100)	 //(edge block) vertex 3
	(-500.000  42.000  0.100)	 //(edge block) vertex 4
	(-500.000  200.000  0.100)	 //(edge block) vertex 5
	(997.201  0.000  0.000)	 //(edge block) vertex 6
	(997.201  42.000  0.000)	 //(edge block) vertex 7
	(997.201  200.000  0.000)	 //(edge block) vertex 8
	(997.201  0.000  0.100)	 //(edge block) vertex 9
	(997.201  42.000  0.100)	 //(edge block) vertex 10
	(997.201  200.000  0.100)	 //(edge block) vertex 11

);


blocks
(
	hex (0 1 47 46 120 121 167 166) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 0, block 0
	hex (1 2 48 47 121 122 168 167) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 0, block 1
	hex (3 4 49 48 123 124 169 168) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 0, block 2
	hex (4 5 50 49 124 125 170 169) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 0, block 3
	hex (46 47 84 83 166 167 204 203) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 0, block 4
	hex (47 48 85 84 167 168 205 204) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 0, block 5
	hex (48 49 86 85 168 169 206 205) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 0, block 6
	hex (49 50 87 86 169 170 207 206) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 0, block 7

	hex (5 6 51 50 125 126 171 170) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 1, block 0
	hex (6 7 52 51 126 127 172 171) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 1, block 1
	hex (8 9 53 52 128 129 173 172) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 1, block 2
	hex (9 10 54 53 129 130 174 173) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 1, block 3
	hex (50 51 88 87 170 171 208 207) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 1, block 4
	hex (51 52 89 88 171 172 209 208) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 1, block 5
	hex (52 53 90 89 172 173 210 209) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 1, block 6
	hex (53 54 91 90 173 174 211 210) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 1, block 7

	hex (10 11 55 54 130 131 175 174) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 2, block 0
	hex (11 12 56 55 131 132 176 175) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 2, block 1
	hex (13 14 57 56 133 134 177 176) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 2, block 2
	hex (14 15 58 57 134 135 178 177) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 2, block 3
	hex (54 55 92 91 174 175 212 211) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 2, block 4
	hex (55 56 93 92 175 176 213 212) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 2, block 5
	hex (56 57 94 93 176 177 214 213) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 2, block 6
	hex (57 58 95 94 177 178 215 214) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 2, block 7

	hex (15 16 59 58 135 136 179 178) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 3, block 0
	hex (16 17 60 59 136 137 180 179) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 3, block 1
	hex (18 19 61 60 138 139 181 180) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 3, block 2
	hex (19 20 62 61 139 140 182 181) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 3, block 3
	hex (58 59 96 95 178 179 216 215) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 3, block 4
	hex (59 60 97 96 179 180 217 216) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 3, block 5
	hex (60 61 98 97 180 181 218 217) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 3, block 6
	hex (61 62 99 98 181 182 219 218) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 3, block 7

	hex (20 21 63 62 140 141 183 182) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 4, block 0
	hex (21 22 64 63 141 142 184 183) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 4, block 1
	hex (23 24 65 64 143 144 185 184) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 4, block 2
	hex (24 25 66 65 144 145 186 185) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 4, block 3
	hex (62 63 100 99 182 183 220 219) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 4, block 4
	hex (63 64 101 100 183 184 221 220) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 4, block 5
	hex (64 65 102 101 184 185 222 221) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 4, block 6
	hex (65 66 103 102 185 186 223 222) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 4, block 7

	hex (25 26 67 66 145 146 187 186) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 5, block 0
	hex (26 27 68 67 146 147 188 187) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 5, block 1
	hex (28 29 69 68 148 149 189 188) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 5, block 2
	hex (29 30 70 69 149 150 190 189) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 5, block 3
	hex (66 67 104 103 186 187 224 223) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 5, block 4
	hex (67 68 105 104 187 188 225 224) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 5, block 5
	hex (68 69 106 105 188 189 226 225) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 5, block 6
	hex (69 70 107 106 189 190 227 226) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 5, block 7

	hex (30 31 71 70 150 151 191 190) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 6, block 0
	hex (31 32 72 71 151 152 192 191) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 6, block 1
	hex (33 34 73 72 153 154 193 192) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 6, block 2
	hex (34 35 74 73 154 155 194 193) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 6, block 3
	hex (70 71 108 107 190 191 228 227) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 6, block 4
	hex (71 72 109 108 191 192 229 228) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 6, block 5
	hex (72 73 110 109 192 193 230 229) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 6, block 6
	hex (73 74 111 110 193 194 231 230) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 6, block 7

	hex (35 36 75 74 155 156 195 194) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 7, block 0
	hex (36 37 76 75 156 157 196 195) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 7, block 1
	hex (38 39 77 76 158 159 197 196) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 7, block 2
	hex (39 40 78 77 159 160 198 197) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 7, block 3
	hex (74 75 112 111 194 195 232 231) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 7, block 4
	hex (75 76 113 112 195 196 233 232) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 7, block 5
	hex (76 77 114 113 196 197 234 233) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 7, block 6
	hex (77 78 115 114 197 198 235 234) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 7, block 7

	hex (40 41 79 78 160 161 199 198) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 8, block 0
	hex (41 42 80 79 161 162 200 199) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($l_grading_x $b_grading_y 1)      	//riblet 8, block 1
	hex (43 44 81 80 163 164 201 200) 	($ribletX_nC $surfaceY_nC 1) 	simpleGrading ($r_grading_x $b_grading_y 1)      	//riblet 8, block 2
	hex (44 45 82 81 164 165 202 201) 	($plateauX_nC $surfaceY_nC 1) 	simpleGrading (1 $b_grading_y 1)      	//riblet 8, block 3
	hex (78 79 116 115 198 199 236 235) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 8, block 4
	hex (79 80 117 116 199 200 237 236) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($l_grading_x $t_grading_y 1)      	//riblet 8, block 5
	hex (80 81 118 117 200 201 238 237) 	($ribletX_nC $fluidY_nC 1) 	simpleGrading ($r_grading_x $t_grading_y 1)      	//riblet 8, block 6
	hex (81 82 119 118 201 202 239 238) 	($plateauX_nC $fluidY_nC 1) 	simpleGrading (1 $t_grading_y 1)      	//riblet 8, block 7

	hex (240 0 46 241 243 120 166 244) 	($LBlockX_nC $surfaceY_nC 1) 	simpleGrading ($inlet_xGrading $b_grading_y 1)        	//LHS, block 0
	hex (241 46 83 242 244 166 203 245) 	($LBlockX_nC $fluidY_nC 1) 	simpleGrading ($inlet_xGrading $t_grading_y 1)        	//LHS, block 1
	hex (45 246 247 82 165 249 250 202) 	($RBlockX_nC $surfaceY_nC 1) 	simpleGrading ($outlet_xGrading $b_grading_y 1)        	//RHS, block 0
	hex (82 247 248 119 202 250 251 239) 	($RBlockX_nC $fluidY_nC 1) 	simpleGrading ($outlet_xGrading $t_grading_y 1)        	//RHS, block 1

);


edges();


boundary
(
	leftWall
	{
		type patch;
		faces
		(
		(240 241 244 243)
		(241 242 245 244)
		);
	}


	rightWall
	{
		type patch;
		faces
		(
		(246 249 250 247)
		(247 250 251 248)
		);
	}

	lowerWall
	{
		type wall;
		faces
		(
		(0 120 121 1)
		(1 121 122 2)
		(2 122 168 48)
		(48 168 123 3)
		(3 123 124 4)
		(4 124 125 5)
		(5 125 126 6)
		(6 126 127 7)
		(7 127 172 52)
		(52 172 128 8)
		(8 128 129 9)
		(9 129 130 10)
		(10 130 131 11)
		(11 131 132 12)
		(12 132 176 56)
		(56 176 133 13)
		(13 133 134 14)
		(14 134 135 15)
		(15 135 136 16)
		(16 136 137 17)
		(17 137 180 60)
		(60 180 138 18)
		(18 138 139 19)
		(19 139 140 20)
		(20 140 141 21)
		(21 141 142 22)
		(22 142 184 64)
		(64 184 143 23)
		(23 143 144 24)
		(24 144 145 25)
		(25 145 146 26)
		(26 146 147 27)
		(27 147 188 68)
		(68 188 148 28)
		(28 148 149 29)
		(29 149 150 30)
		(30 150 151 31)
		(31 151 152 32)
		(32 152 192 72)
		(72 192 153 33)
		(33 153 154 34)
		(34 154 155 35)
		(35 155 156 36)
		(36 156 157 37)
		(37 157 196 76)
		(76 196 158 38)
		(38 158 159 39)
		(39 159 160 40)
		(40 160 161 41)
		(41 161 162 42)
		(42 162 200 80)
		(80 200 163 43)
		(43 163 164 44)
		(44 164 165 45)
		(240 243 120 0)
		(45 165 249 246)
		);
	}

	upperWall
	{
		type patch;
		faces
		(
		(83 84 204 203)
		(84 85 205 204)
		(85 86 206 205)
		(86 87 207 206)
		(87 88 208 207)
		(88 89 209 208)
		(89 90 210 209)
		(90 91 211 210)
		(91 92 212 211)
		(92 93 213 212)
		(93 94 214 213)
		(94 95 215 214)
		(95 96 216 215)
		(96 97 217 216)
		(97 98 218 217)
		(98 99 219 218)
		(99 100 220 219)
		(100 101 221 220)
		(101 102 222 221)
		(102 103 223 222)
		(103 104 224 223)
		(104 105 225 224)
		(105 106 226 225)
		(106 107 227 226)
		(107 108 228 227)
		(108 109 229 228)
		(109 110 230 229)
		(110 111 231 230)
		(111 112 232 231)
		(112 113 233 232)
		(113 114 234 233)
		(114 115 235 234)
		(115 116 236 235)
		(116 117 237 236)
		(117 118 238 237)
		(118 119 239 238)
		(242 83 203 245)
		(119 248 251 239)
		);
	}
);


mergePatchPairs();
