3D_riblet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../parameters.dat"

phases (biofilm fluid);

biofilm
{
    //represents ketchup here
    transportModel  Newtonian;
    nu              1e-3;
    rho             1000;
}

fluid
{
    //now represents water
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

sigma            $sigma;

// ************************************************************************* //
